{
  "$help": "https://github.com/microsoft/winget-pkgs/tree/master/manifests",
  "$schema": "https://aka.ms/winget-packages.schema.2.0.json",
  "CreationDate": "2023-11-28T14:11:28.696-00:00",
  "Sources": [
    {
      "Packages": [
        { "PackageIdentifier": "Microsoft.WingetCreate", "Version": "1.5.7.0" },

        // archivator
        { "PackageIdentifier": "7zip.7zip", "Version": "23.01" },

        // audio-firmware
{{ if eq .asio_driver "flexasio" -}} { "PackageIdentifier": "dechamps.FlexASIO", "Version": "1.9" }, {{ end }}

        // audio-tools
        { "PackageIdentifier": "VB-Audio.Voicemeeter.Banana", "Version": "2.0.6.8" },

{{ if eq .is_equalizerapo true -}} { "PackageIdentifier": "jthedering.EqualizerAPO", "Version": "1.2.1" }, // TODO: https://github.com/microsoft/winget-pkgs/issues/9186 {{ end }}

        // credentials
        { "PackageIdentifier": "Bitwarden.Bitwarden", "Version": "2023.10.1" },
        { "PackageIdentifier": "GnuPG.Gpg4win", "Version": "4.2.0" },

        // fs
        { "PackageIdentifier": "Google.GoogleDrive", "Version": "84.0.4.0" },

        // io
        { "PackageIdentifier": "Ookla.Speedtest.CLI", "Version": "1.2.0" },
        { "PackageIdentifier": "WiresharkFoundation.Wireshark", "Version": "4.2.3" },

        // gaming
        { "PackageIdentifier": "Blizzard.BattleNet", "Version": "2.26.1.14494" }, // TODO: https://github.com/microsoft/winget-pkgs/issues/60622
        { "PackageIdentifier": "EpicGames.EpicGamesLauncher", "Version": "1.3.82.0" },
        { "PackageIdentifier": "GOG.Galaxy", "Version": "2.0.73.27" },
        { "PackageIdentifier": "Ubisoft.Connect", "Version": "150.1.0.11037" },
        { "PackageIdentifier": "Valve.Steam", "Version": "2.10.91.91" },

        // mode-android
        { "PackageIdentifier": "Google.AndroidStudio", "Version": "2023.2.1.23" },
        { "PackageIdentifier": "Google.PlatformTools", "Version": "34.0.5" },
        { "PackageIdentifier": "Genymobile.scrcpy", "Version": "2.1.1" },

        // mode-c
        { "PackageIdentifier": "Kitware.CMake", "Version": "3.28.1" },

        // mode-cri
        { "PackageIdentifier": "hadolint.hadolint", "Version": "2.12.0" },

{{ if eq .cri "docker" -}} { "PackageIdentifier": "Docker.DockerDesktop", "Version": "4.28.0" }, {{ end }}

{{ if eq .is_act true -}} { "PackageIdentifier": "nektos.act", "Version": "0.2.56" }, {{ end }}

        // mode-go
        { "PackageIdentifier": "GoLang.Go", "Version": "1.22.1" },

        // mode-java
        { "PackageIdentifier": "Gradle.Gradle", "Version": "8.6" }, // TODO: https://github.com/microsoft/winget-pkgs/issues/2964
        { "PackageIdentifier": "Oracle.JDK.21", "Version": "21.0.2" },

        // mode-js
        { "PackageIdentifier": "OpenJS.NodeJS", "Version": "21.2.0" },

        // mode-k8s
        { "PackageIdentifier": "Helm.Helm", "Version": "3.13.3" },
        { "PackageIdentifier": "Kubernetes.kubectl", "Version": "1.29.0" },
        { "PackageIdentifier": "Kubernetes.minikube", "Version": "1.32.0" },

        // mode-py
        { "PackageIdentifier": "Python.Python.3.12", "Version": "3.12.0" },

        // mode-rs
        { "PackageIdentifier": "Rustlang.Rustup", "Version": "1.26.0" },

        // mode-shell
        { "PackageIdentifier": "JanDeDobbeleer.OhMyPosh", "Version": "19.4.0" },
        { "PackageIdentifier": "Microsoft.PowerShell", "Version": "7.4.0.0" },

{{ if eq .term "windows_terminal" -}} { "PackageIdentifier": "Microsoft.WindowsTerminal", "Version": "1.18.2822.0" }, {{ end }}

        // mode-terraform
        { "PackageIdentifier": "OpenTofu.Tofu.RC", "Version": "1.6.0-rc1" },

        // power
        { "PackageIdentifier": "REALiX.HWiNFO", "Version": "7.66" },

{{ if eq .is_systeminformer true -}} { "PackageIdentifier": "WinsiderSS.SystemInformer", "Version": "3.0.7333" }, // TODO: https://github.com/microsoft/winget-pkgs/issues/109907 {{ end }}

        // recording
        { "PackageIdentifier": "ShareX.ShareX", "Version": "15.0.0" },

{{ if eq .is_obs true -}} { "PackageIdentifier": "OBSProject.OBSStudio", "Version": "30.0.0" }, {{ end }}

        // system
        { "PackageIdentifier": "CodecGuide.K-LiteCodecPack.Full", "Version": "17.9.4" },
        { "PackageIdentifier": "File-New-Project.EarTrumpet", "Version": "2.3.0.0" },
        { "PackageIdentifier": "Microsoft.DotNet.DesktopRuntime.8", "Version": "8.0.0" },
        { "PackageIdentifier": "Microsoft.PowerToys", "Version": "0.75.1" },
        { "PackageIdentifier": "Microsoft.VCRedist.2015+.x64", "Version": "14.38.33130.0" },
        { "PackageIdentifier": "Microsoft.VCRedist.2015+.x86", "Version": "14.38.33130.0" },

{{ if eq .is_git true -}} { "PackageIdentifier": "Git.Git", "Version": "2.43.0" }, {{ end }}

        // theme
        { "PackageIdentifier": "Armin2208.WindowsAutoNightMode", "Version": "10.4.0.35" },

        // user
        { "PackageIdentifier": "DeepL.DeepL", "Version": "24.1.2.11804" },
        { "PackageIdentifier": "Google.NearbyShare", "Version": "1.0.1184.0" },
        { "PackageIdentifier": "Gyan.FFmpeg", "Version": "6.1" },
        { "PackageIdentifier": "JAMSoftware.TreeSize.Free", "Version": "4.7.2" },
        { "PackageIdentifier": "jqlang.jq", "Version": "1.7.1" },
        { "PackageIdentifier": "Microsoft.VisualStudio.2022.Enterprise", "Version": "17.8.1" },
        { "PackageIdentifier": "Telegram.TelegramDesktop", "Version": "4.11.6" },
        { "PackageIdentifier": "twpayne.chezmoi", "Version": "2.41.0" },
        { "PackageIdentifier": "VideoLAN.VLC", "Version": "3.0.20" },
        { "PackageIdentifier": "yt-dlp.yt-dlp", "Version": "2023.10.13" },

{{ if eq .browser     "chrome"  -}} { "PackageIdentifier": "Google.Chrome", "Version": "122.0.6261.95" },       {{ end }}
{{ if eq .browser     "firefox" -}} { "PackageIdentifier": "Mozilla.Firefox", "Version": "122.0.1" },           {{ end }}
{{ if eq .editor      "helix"   -}} { "PackageIdentifier": "Helix.Helix", "Version": "23.10" },                 {{ end }}
{{ if eq .visual      "vscode"  -}} { "PackageIdentifier": "Microsoft.VisualStudioCode", "Version": "1.84.2" }, {{ end }}

{{ if eq .is_chatterino  true -}} { "PackageIdentifier": "ChatterinoTeam.Chatterino", "Version": "2.4.6" },       {{ end }}
{{ if eq .is_discord     true -}} { "PackageIdentifier": "Discord.Discord", "Version": "1.0.9024" },              {{ end }}
{{ if eq .is_qbittorrent true -}} { "PackageIdentifier": "qBittorrent.qBittorrent", "Version": "4.6.0" },         {{ end }}
{{ if eq .is_spotify     true -}} { "PackageIdentifier": "Spotify.Spotify", "Version": "1.2.25.1011.g0348b2ea" }, {{ end }}

        // v12n
        { "PackageIdentifier": "Canonical.Ubuntu.2204", "Version": "2204.1.7.0" },
        { "PackageIdentifier": "SoftwareFreedomConservancy.QEMU", "Version": "8.0.2" },

        // vnc
        { "PackageIdentifier": "uvncbvba.UltraVnc", "Version": "1.4.3.6" },
      ],
      "SourceDetails": {
        "Argument": "https://cdn.winget.microsoft.com/cache",
        "Identifier": "Microsoft.Winget.Source_8wekyb3d8bbwe",
        "Name": "winget",
        "Type": "Microsoft.PreIndexed.Package"
      }
    }
  ],
  "WinGetVersion": "1.6.3133"
}
